Revit 2026 API

# ValueAtPoint(ValueAtPoint) Constructor

---

Creates a copy of the given ValueAtPoint instance.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ValueAtPoint(
	ValueAtPoint otherObject
)
```
```vb
Public Sub New (
	otherObject As ValueAtPoint
)
```
```cpp
public:
ValueAtPoint(
	ValueAtPoint^ otherObject
)
```
```fsharp
new :
        otherObject : ValueAtPoint -> ValueAtPoint
```

#### Parameters

otherObject ValueAtPoint

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ValueAtPoint Class

ValueAtPoint Overload

Autodesk.Revit.DB.Analysis Namespace